MA-Lugo/STM32F103_gdrivers/Inc/stm32f103_usart_driver.h
/*
 * stm32f103_usart_driver.h
 *
 *  Created on: 7 may. 2021
 *      Author: Mario
 */

#ifndef INC_STM32F103_USART_DRIVER_H_
#define INC_STM32F103_USART_DRIVER_H_


#include "stm32f103xx.h"


typedef struct
{
	uint8_t		USART_Mode;
	uint32_t	USART_Baud;
	uint8_t		USART_StopBits;
	uint8_t		USART_WordLenght;
	uint8_t		USART_Parity;
	uint8_t		USART_HWFlow;

}USART_Config_t;


/*
 * Handle structure for USARTx peripheral
 */

typedef struct
{

	USART_RegDef_t 		*pUSARTx;
	USART_Config_t	 	  USART_Config;

}USART_Handle_t;




/*
 * @USART_Mode
 * Possible options for USART_Mode
 */

#define USART_MODE_ONLY_TX	0
#define USART_MODE_ONLY_RX	1
#define USART_MODE_TXRX		2




/*
 * @USART_Baud
 * Possible options for USART_Baud
 */

#define USART_STD_BAUD_1200				1200
#define USART_STD_BAUD_2400				2400
#define USART_STD_BAUD_9600				9600
#define USART_STD_BAUD_19200			19200
#define USART_STD_BAUD_38400			38400
#define USART_STD_BAUD_57600			57600
#define USART_STD_BAUD_115200			115200
#define USART_STD_BAUD_230400			230400
#define USART_STD_BAUD_460800			460800
#define USART_STD_BAUD_921600			921600



/*
 * @USART_Parity
 * Possible options for USART_Parity
 */


#define USART_PARITY_EN_ODD		2
#define USART_PARITY_EN_EVEN	1
#define USART_PARITY_EN_DISABLE	0


/*
 * @USART_WordLenght
 * Possible options for USART_WordLenght
 */

#define USART_WORDLEN_8BITS		0
#define USART_WORDLEN_9BIT		1



/*
 * @USART_StopBits
 * Possible options for USART_StopBits
 */

#define USART_STOPBITS_1			0
#define USART_STOPBITS_0_			1
#define USART_STOPBITS_2			2
#define USART_STOPBITS_1_5			3



/*
 * @USART_HWFlowControl
 * Possible options for USART_HWFlowControl
 */


#define USART_HW_FLOW_CTRL_NONE				0
#define USART_HW_FLOW_CTRL_CTS				1
#define USART_HW_FLOW_CTRL_RTS				2
#define USART_HW_FLOW_CTRL_CTS_RTS			3



/*
 * USART Related Status Flags Definitions
 */
#define USART_FLAG_PE				(1 << USART_SR_PE)
#define USART_FLAG_FE				(1 << USART_SR_FE)
#define USART_FLAG_NE				(1 << USART_SR_NE)
#define USART_FLAG_ORE				(1 << USART_SR_ORE)
#define USART_FLAG_IDLE				(1 << USART_SR_IDLE)
#define USART_FLAG_RXNE				(1 << USART_SR_RXNE)
#define USART_FLAG_TC				(1 << USART_SR_TC)
#define USART_FLAG_TXE				(1 << USART_SR_TXE)
#define USART_FLAG_LBD				(1 << USART_SR_LBD)
#define USART_FLAG_CTS				(1 << USART_SR_CTS)







/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/





/*
 * Peripheral Clock setup
 */

void USART_CLK_Control(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);



/*
 * Init and De-init
 */
void  USART_Init(USART_Handle_t *pUSARTHandle,uint32_t SysCLK);



/*
 * Data Send and Receive
 */
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);

/*
 * IRQ Configuration and ISR handling
 */
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void USART_IRQHandling(USART_Handle_t *pHandle);

/*
 * Other Peripheral Control APIs
 */
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName);
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate, uint32_t SysCLK);

/*
 * Application callback
 */
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEv);




#endif /* INC_STM32F103_USART_DRIVER_H_ */
